#include "CountDown.h"
#include "SoundManager.h"
#include "DxLib.h"

//============================================================
// コンストラクタ（カウントダウンの初期化）
//============================================================
CountDown::CountDown()
{
	state = WAIT_START;   //　ゲーム開始前の状態
	countdownTimer = 180; //  カウントダウン用タイマー（３秒：60fps×3）
}

//============================================================
// カウントダウン状態の更新処理
//============================================================
void CountDown::Update()
{
	//------------------------------------------------------------
	// ゲーム開始待ち状態
	//------------------------------------------------------------
	if (state == WAIT_START)
	{
		//ENTERキーが押されたらカウントダウン開始
		if (CheckHitKey(KEY_INPUT_RETURN))
		{
			//効果音再生
			PlaySoundMem(SoundManager::titleSE, DX_PLAYTYPE_BACK);

			//カウントダウン状態へ
			state = COUNTDOWN;
		}
		return;
	}

	//------------------------------------------------------------
	// カウントダウン処理
	//------------------------------------------------------------
	if (state == COUNTDOWN)
	{
		//タイマーを減らす
		countdownTimer--;

		//タイマーが0になったらゲーム開始
		if (countdownTimer == 0)
		{
			state = END;
		}
		return;
	}
}

//============================================================
// カウントダウンの描画処理
//============================================================
void CountDown::Draw(int x, int y)
{
	//------------------------------------------------------------
	// ゲーム開始前の表示
	//------------------------------------------------------------
	if (state == WAIT_START)
	{
		SetFontSize(30);
		DrawString(200, 10, TEXT("タイピングゲーム"), GetColor(230, 230, 230));
		DrawString(200, 240, TEXT("ENTERキーでスタート"), GetColor(255, 255, 255));

		return;
	}

	//------------------------------------------------------------
	// カウントダウン表示
	//------------------------------------------------------------
	if (state == COUNTDOWN)
	{
		// 残り秒数を計算
		int count = countdownTimer / 60 + 1;

		SetFontSize(80);
		// カウント数字を表示
		DrawFormatString(300, 220, GetColor(255, 255, 255), TEXT("%d"), count);
		return;
	}
}

//============================================================
// カウントダウン終了判定
// true：カウントダウン終了
//============================================================
bool CountDown::IsFinished() const
{
	return state == END;
}
