#pragma once
#include "DxLib.h"

//============================================================
// 仮想キーボード表示クラス
//
// タイピングゲームで現在入力するキーを
// 視覚的に分かりやすくするための表示機能
//============================================================
class Keyboard
{
private:
	//------------------------------------------------------------
    // キーボード配列（QWERTY配列）
    //------------------------------------------------------------
	TCHAR row1[10] = { 'Q','W','E','R','T','Y','U','I','O','P' };
	TCHAR row2[9] = { 'A','S','D','F','G','H','J','K','L' };
	TCHAR row3[7] = { 'Z','X','C','V','B','N','M' };
public:
    //------------------------------------------------------------
    // 仮想キーボード描画
    //
    // target : 強調表示するキー
    // startX : 描画開始X座標
    // startY : 描画開始Y座標
    //------------------------------------------------------------
	void Draw(TCHAR target,TCHAR missKey, int startX, int startY);
};

