#pragma once
#include "DxLib.h"
#include "Scene.h"
#include "Keyboard.h"
#include "Scoreboard.h"
#include "ChalkEffect.h"

//============================================================
// 1文字タイピング練習モードのシーン
//============================================================
class PracticeTypingScene_1 :public Scene
{
private:
	//------------------------------------------------------------
	// タイピングデータ
	//------------------------------------------------------------
	char target;     // 現在入力する文字（A～Z）
	int score;       // 正解数
	int miss;        // ミス数
	
	//------------------------------------------------------------
	// ミス表示
	//------------------------------------------------------------
	int missTimer;   //ミスしたときに文字が赤くなる時間


	//------------------------------------------------------------
	// 画面関連
	//------------------------------------------------------------
	int gameImage;  //背景画面
	int screenW;    //画面幅
	int screenH;    //画面高さ

	//------------------------------------------------------------
	// 入力管理
	//------------------------------------------------------------
	char keyNow[256];  // 現在フレームのキー状態
	char keyOld[256];  // 前フレームのキー状態

	//------------------------------------------------------------
	// UI表示
	//------------------------------------------------------------
	Keyboard keyboard;       //キーボード表示
	Scoreboard scoreboard;   //スコアボード表示
	
	//------------------------------------------------------------
	// エフェクト
	//------------------------------------------------------------
	ChalkEffect chalk;     // チョーク粉エフェクト

	//------------------------------------------------------------
	// コンボ
	//------------------------------------------------------------
	int combo;        // 現在コンボ
	int maxCombo;     // 最大コンボ

public:
	//コンストラクタ
	PracticeTypingScene_1();

	//デストラクタ
	~PracticeTypingScene_1();

	//更新処理
	void Update()override;

	//描画処理
	void Draw()override;  

};

