#pragma once
#include "Scene.h"
#include "Keyboard.h"
#include "CountDown.h"
#include "Scoreboard.h"
#include "ChalkEffect.h"

//============================================================
// ひらがなタイピング用データ
// display : 表示文字
// input   : 入力ローマ字
//============================================================
struct WordData_2
{
	const TCHAR* display; 
	const TCHAR* input;   
};

//============================================================
// ひらがなタイピングシーン
//============================================================
class PracticeTypingScene_2:public Scene
{
private:
	
	// 現在の単語
	WordData_2 currentWord;     

	// 現在の単語番号
	int kanaIndex;

	// 何文字目まで入力したか
	int charIndex;           

	// タイピング処理
	void TypingUpdate();

	//------------------------------------------------------------
	// タイピングデータ
	//------------------------------------------------------------
	int score;               // スコア
	int miss;                // ミス

	//------------------------------------------------------------
	// 入力管理
	//------------------------------------------------------------
	char keyNow[256];        // 現在フレームのキー情報
	char keyOld[256];        // 前フレームのキー情報

	//------------------------------------------------------------
    // 画面関連
    //------------------------------------------------------------
	int gameImage;  // 背景画面
	int screenW;    // 画面幅
	int screenH;    // 画面高さ

	//------------------------------------------------------------
	// コンボ
	//------------------------------------------------------------
	int combo;             // 現在コンボ
	int maxCombo;          // 最大コンボ
	bool missFlag = false; // この単語でミスしたか

	//------------------------------------------------------------
	// ミス表示
	//------------------------------------------------------------
	int missTimer;   // ミスしたときに文字が赤くなる時間
	int missIndex;   // ミスした文字を取得

	//------------------------------------------------------------
	// 表示文字位置
	//------------------------------------------------------------
	const int WORD_X = 270;     // 文字列の開始X位置
	const int WORD_Y = 210;     // 文字列の開始Y位置
	const int WORD_SPACE = 15;  // 文字の間隔

	// キーボード描画管理
	Keyboard keyboard;

	// カウントダウン管理
	CountDown countdown;

	// スコアボード描画管理
	Scoreboard scoreboard;

	// チョークエフェクト管理
	ChalkEffect chalk;

public:
	// コンストラクタ
	PracticeTypingScene_2();

	// デストラクタ
	~PracticeTypingScene_2();

	// 更新処理
	void Update()override;

	// 描画処理
	void Draw()override;
};

