#include "ResultScene.h"
#include "DxLib.h"
#include "GameManager.h"
#include "Scoreboard.h"
#include "TitleScene.h"

//============================================================
// コンストラクタ
// ゲーム終了時のスコア・ミス数・最大コンボを受け取り
// リザルト画面用のデータを初期化する
//============================================================
ResultScene::ResultScene(int score ,int miss ,int maxCombo)
{
	//------------------------------------------------------------
	// リザルトデータ保存
	//------------------------------------------------------------
	finalScore = score;    //最終スコア
	finalMiss = miss;      //ミス回数
	MaxCombo = maxCombo;   //最大コンボ数

	//------------------------------------------------------------
	// 画面サイズ取得
	//------------------------------------------------------------
	GetDrawScreenSize(&screenW, &screenH);

	//------------------------------------------------------------
	// 背景画像読み込み
	//------------------------------------------------------------
	resultImage = LoadGraph(TEXT("Resource/blackboard.png"));

	//------------------------------------------------------------
	// スコアによるランク判定
	//------------------------------------------------------------
	if (miss == 0 && score == 30)
	{
		rank = TEXT("SS");
		rankColor = GetColor(0, 0, 0);       // 黒
	}
	else if (score == 30)
	{
		rank = TEXT("S");
		rankColor = GetColor(0, 0, 255);     // 青
	}
	else if (score >= 25)
	{
		rank = TEXT("A");
		rankColor = GetColor(255, 255, 0);   // 黄
	}
	else if (score >= 20)
	{
		rank = TEXT("B");
		rankColor = GetColor(255, 0, 0);     // 赤
	}
	else if (score >= 15)
	{
		rank = TEXT("C");
		rankColor = GetColor(0, 255, 0);     // 緑
	}
	else
	{
		rank = TEXT("D");
		rankColor = GetColor(0, 255, 255);   // 水色
	}
}

//============================================================
// デストラクタ（使用した画像の解放）
//============================================================
ResultScene::~ResultScene()
{
	DeleteGraph(resultImage);
}

//============================================================
// 更新処理
//============================================================
void ResultScene::Update()
{
	// スペースキーでタイトル画面へ
	if (CheckHitKey(KEY_INPUT_SPACE))
	{
		GameManager::GetInstance().ChangeScene(new TitleScene());
	}
}

//============================================================
// 描画処理
//============================================================
void ResultScene::Draw()
{
	
	//背景画像を画面全体に表示
	DrawExtendGraph(0, 0, screenW, screenH,resultImage, TRUE);

	SetFontSize(50);
	//------------------------------------------------------------
	// リザルトタイトル表示
	//------------------------------------------------------------
	DrawString(200, 10, TEXT("リザルト"), GetColor(230, 230, 230));

	SetFontSize(30);
	//------------------------------------------------------------
    // スコア情報表示
    //------------------------------------------------------------
	DrawFormatString(200, 100, GetColor(230, 230, 230), TEXT("スコア: %d"), finalScore);

	//------------------------------------------------------------
    // タイプミス数の表示
    //------------------------------------------------------------
	DrawFormatString(200, 150, GetColor(230, 230, 230),TEXT("ミス: %d"), finalMiss);

	//------------------------------------------------------------
	// 最大コンボ数表示
	//------------------------------------------------------------
	DrawFormatString(200, 200, GetColor(230, 230, 230), TEXT("最大コンボ数: %d"), MaxCombo);

	//------------------------------------------------------------
	// 正確率
	//------------------------------------------------------------
	float accuracy = 0.0f;

	int total = finalScore + finalMiss;

	if (total > 0)
	{
		accuracy = (float)finalScore / total * 100;
	}
	DrawFormatString(200, 250, GetColor(230, 230, 230), TEXT("正確率: %.1f%%"), accuracy);


	SetFontSize(16);
	//------------------------------------------------------------
	// 操作案内
	//------------------------------------------------------------
	DrawString(430, 420, TEXT("Spaceでタイトル"), GetColor(230, 230, 230));

	SetFontSize(40);
	//------------------------------------------------------------
	// ランク表示
	//------------------------------------------------------------
	DrawFormatString(200, 310, rankColor, TEXT("ランク: %s"), rank);

	//スコアボード表示
	scoreboard.Draw(480, 10);
}
