#pragma once

//============================================================
// Sceneクラス
// 全てのゲームシーンの基底クラス（インターフェース）
//
// タイトル画面・ゲーム画面・リザルト画面などの
// 各シーンはこのクラスを継承して作成する
//============================================================
class Scene
{
public:
	//------------------------------------------------------------
	// 仮想デストラクタ
	//------------------------------------------------------------
	virtual ~Scene(){}
      
	// 更新処理
	virtual void Update() = 0;

	// 描画処理
	virtual void Draw() = 0;
};

