#pragma once
#include <tchar.h>
#include "Scene.h"
#include "Keyboard.h"
#include "CountDown.h"
#include "Scoreboard.h"
#include "ChalkEffect.h"

// 単語の最大数
static const int MAX_WORDS = 30;

//============================================================
// 単語データ構造体
//============================================================
struct WordData
{
	const TCHAR* display; // 表示用（日本語）
	const TCHAR* input;   // 判定用（ローマ字）
};

//============================================================
// WordTypingScene
// 単語タイピングゲームのメインシーン
//============================================================
class WordTypingScene:public Scene
{
private:
	//------------------------------------------------------------
	// ゲーム進行管理
	//------------------------------------------------------------

	 //現在の単語
	WordData currentWord;

	//難易度ごとの単語リスト
	WordData* wordList;     

	//単語の数を保存
	int wordCount;         

	// 何文字目まで入力したか
	int charIndex;          

	// 単語の出現順をランダムに
	int order[MAX_WORDS];   

	// /現在何番目の単語なのかを保存
	int wordIndex;           

	//------------------------------------------------------------
	// タイピングデータ
	//------------------------------------------------------------
	int score;               //スコア
	int miss;                //ミス
	int timeLimit;           //制限時間

	//------------------------------------------------------------
	// 入力管理
	//------------------------------------------------------------
	char keyNow[256];        //現在フレームのキー情報
	char keyOld[256];        //前フレームのキー情報

	//------------------------------------------------------------
	// 内部処理
	//------------------------------------------------------------
	void UpdateInput();      //キー入力の更新
	void CheckTyping();      //タイピング判定
	void NextWord();         // 次の単語へ
	bool IsTimeUp() const;   // 時間切れ判定

	//------------------------------------------------------------
	// 画面関連
	//------------------------------------------------------------
	int otherGameImage;  // 背景画面
	int screenW;         // 画面幅
	int screenH;         // 画面高さ

	//------------------------------------------------------------
	// コンボ
	//------------------------------------------------------------
	int combo;              // 現在コンボ
	int maxCombo;           // 最大コンボ
	bool missFlag = false;  // この単語でミスしたか


	//------------------------------------------------------------
	// ミス表示
	//------------------------------------------------------------
	int missTimer;   //ミスしたときに文字が赤くなる時間
	int missIndex;   //ミスした文字を取得

	//------------------------------------------------------------
	//難易度ごとの表示管理
	//------------------------------------------------------------
	
	// かんたん・ふつう・むずかしい
	const TCHAR* diffText; 

	// 難易度を表示する色
	int diffColor;         

	// キーボード描画管理
	Keyboard keyboard;

	// カウントダウン管理
	CountDown countdown;

	// スコアボード描画管理
	Scoreboard scoreboard;

	// チョークエフェクト管理
	ChalkEffect chalk;
public:

	// コンストラクタ
	WordTypingScene();

	// デストラクタ
	~WordTypingScene();

	// 更新処理
	void Update()override;

	// 描画処理
	void Draw()override;
};

