#pragma once
#include "Scene.h"

//============================================================
// ゲーム説明画面クラス
// 操作方法やゲームモードの説明を表示する
//============================================================
class ExplanationScene:public Scene
{
private:
	//------------------------------------------------------------
    // 背景画像
    //------------------------------------------------------------
	int ExplanationImage;

	//------------------------------------------------------------
	//画面サイズ
	//------------------------------------------------------------
	int screenW;
	int screenH;

	//------------------------------------------------------------
	//入力管理
	//------------------------------------------------------------
	bool prevEnter;
	bool nowEnter;


public:

	//コンストラクタ
	ExplanationScene();

	//デストラクタ
	~ExplanationScene();
	
	//更新処理
	void Update() override;

	//描画処理
	void Draw() override;
};

