#pragma once
#include "DxLib.h"
#include "Scene.h"

//============================================================
// TitleSceneクラス
// ゲーム開始時に表示されるタイトル画面
//============================================================
class TitleScene :public Scene
{
private:
	//------------------------------------------------------------
	// 画像
	//------------------------------------------------------------
	int titleImage;  // タイトル画像

	//------------------------------------------------------------
	// 画面関連
	//------------------------------------------------------------
	int screenW;    // 画面幅
	int screenH;    // 画面高さ

public:
	// コンストラクタ
	TitleScene();

	// デストラクタ
	~TitleScene();

	// 更新処理
	void Update()override;

	// 描画処理
	void Draw()override;
};

